test/fixtures/xml/fedex/testcases/track_valid.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/track/v8'>
  <soapenv:Header/>
  <soapenv:Body>
    <TrackRequest>
      <WebAuthenticationDetail>
         <UserCredential>
            <Key>rscqm75MLampLUuV</Key>
            <Password>8rTZHQ6vbyOsGOgtwMXrZ1kIU</Password>
         </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
         <AccountNumber>510087267</AccountNumber>
         <MeterNumber>118511895</MeterNumber>
      </ClientDetail>
      <Version>
        <ServiceId>trck</ServiceId>
        <Major>8</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <SelectionDetails>
        <CarrierCode>FDXE</CarrierCode>
        <PackageIdentifier>
          <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
          <Value>123456789012</Value>
        </PackageIdentifier>
      </SelectionDetails>
      <ProcessingOptions>INCLUDE_DETAILED_SCANS</ProcessingOptions>
    </TrackRequest>
  </soapenv:Body>
</soapenv:Envelope>